[
  {"symbol": 1,"name": "Watson's Diary", "site": "https://watsons-diary.herokuapp.com/", "repo": "https://github.com/justwes2/watsons-diary", "about": "For my General Assembly capstone project, I leveraged IBM Watson's Natural Language Understanding API to analyze the user’s text. I was able to construct not just a table based on the returned data, but also a radar chart, using chart.js. The goal of this app is to allow users to gain insight into their thoughts and identify phrases that inspire specific emotions. I enjoyed working on this project and hope to keep exploring these sorts of technologies to empower people to see themselves more clearly and understand their needs better.", "tech": "IBM Watson, Angular, Node, and Express"},
  {"symbol": 2,"name": "Wellnyss", "site": "https://wellnyss.herokuapp.com/", "repo": "https://github.com/justwes2/wellnyss", "about": "Wellnyss was built on Ruby on Rails after about two months of coding. The app allows users to report mental wellness self assessments and get targeted feedback based on the report. Coming from a psychiatric rehab background, it was rewarding to apply my coding skillset to problems I faced in my former occupation", "tech": "Ruby on Rails, Devise, Twitter Bootstrap"},
  {"symbol": 3,"name": "Link", "site": "https://laurkgol.github.io/Front_End_Link_Proj_3/#/", "repo": "https://github.com/laurkgol/Front_End_Link_Proj_3", "about": "I built Link as a part of a small agile team; it is built on Angular with a independently hosted Rails server. Link is an app for web dev students to create profiles, and sign up to attend events relevant to their studies. Link was a great opportunity to code as a team, and learn about the advantages and potential pitfalls of doing so.", "tech": "Rails server, Angular"},
  {"symbol": 4,"name": "Towers of Hanoi", "site": "https://justwes2.github.io/ga-project-1/", "repo": "https://github.com/justwes2/ga-project-1", "about": "This was my first coding project, it's built with html, css, and jQuery. Towers of Hanoi is a classic mathematical riddle, so I built an app for users to solve it. I made it after only a few weeks of coding, and I use it as a reminder of how far I've come in a short time", "tech": "HTML, CSS, Javascript, jQuery"},
  {"symbol": 5, "name": "Link's Bag of Infinite Holding", "site": "https://links-bag-of-infinite-holding.herokuapp.com/#/items", "repo":"https://github.com/hawkins-will/links_bag_of_infinite_holding", "about": "This was the result of a one day pair coding assignement. We were able to create a full stack MEAN app. Its functionally an inventory management system, dressed up in Legend of Zelda, because why not? Be warned, BGM autoplays.", "tech": "Angular, Node, Express, Handlebars, Mongoose, MongoDB"},
  {"symbol": 6, "name": "Choose Your Team!", "site": "https://justwes2.github.io/chooseYourTeam/", "repo":"https://github.com/justwes2/chooseYourTeam", "about": "After I finished my Web Development Immersive Bootcamp, I wanted to put together something fun and lightweight. I decided to make a pokemon team selector. I've been a fan of pokemon for longer than the average pokemon fan has been alive, so I wanted to create a tool to compare each pokemon against each other without having the user interate over the loop six times to fill a rooster. Thus, the app challenges the user to eliminate their least preferred from a list of seven.", "tech": "Angular"}
]
